app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Goga"], ["password", "123"], ["created_at", "2020-12-15 21:35:41.990896"], ["updated_at", "2020-12-15 21:35:41.990896"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "1231"], ["updated_at", "2020-12-16 15:32:22.341465"], ["id", 4]]

  def register
    @user = User.new(user_params)
    @user.password = Digest::MD5.hexdigest((params[:user])[:password])
    if @user.save
---
INSERT INTO "users" ("name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "iu2"], ["password", "202cb962ac59075b964b07152d234b70"], ["created_at", "2020-12-26 15:03:42.934489"], ["updated_at", "2020-12-26 15:03:42.934489"]]

  def login

    user = User.find_by name: params[:name], password: Digest::MD5.hexdigest(params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? AND "users"."password" = ? LIMIT ?  [["name", "iu2"], ["password", "123"], ["LIMIT", 1]]